cask_args appdir: '/Applications'

# shell
brew 'starship'
brew 'eza'
brew 'fzf'
brew 'fzf-tab'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# editor (neovim + LazyVim deps)
brew 'neovim'
brew 'ripgrep'
brew 'fd'
brew 'lazygit'
brew 'node'

# tools
brew 'gh'
brew 'herdr'
brew 'wget'
brew 'imagemagick'

cask 'ghostty'
cask 'font-maple-mono-nf'
cask '1password'
